# Дан список имен.
# Найдите самое длинное имя, если таких имен несколько - выведи любое их них

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Иннокентий", "Петр"]
x = 0
for i in names:
    if x < len(i):
        x = len(i)
        name_long = i
print(name_long)

# или короткий вариант
print(max(names, key=len))
